---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroManagerIterator.CurrentObject
source: html/cd48f1f3-012d-c5a2-01f2-b5b413188959.htm
---
# Autodesk.Revit.DB.Macros.MacroManagerIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```